#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

/**********************************************************************
******************************指针*************************************
**********************************************************************/

/*****************************指针数组********************************/
//存放指针的数组
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c = 30;
//	int* pa = &a;
//	int* pb = &b;
//	int* pc= &c;
//	int* arr[3]={&a,&b,&c};
//	int i = 0;
//	for (i = 0;i <= 2;i++)
//	{
//		printf("%d ", *(arr[i]));
//	}
//}


/*****************************二级指针********************************/

//int main()
//{
//	int a = 10;
//	int* pa = &a;
//	int** ppa = &pa;//ppa为二级指针
//	int*** pppa = &ppa;//三级指针
//	printf("%d\n", **ppa);
//}

/*****************************指针运算********************************/

//比较大小
//指针比较允许与最后元素后的地址比较，不允许与首元素之前的地址比较

//一般情况数组名表示首元素的地址
//&数组名，取出的是整个数组的地址
//sizeof(数组名)，表示整个数组

//int main()
//{
//	int arr[10] = { 0 };
//
//	printf("%p\n", arr);//首元素的地址
//	printf("%p\n", arr+1);
//
//	printf("%p\n", &arr[0]);
//	printf("%p\n", &arr[0]+1);
//
//	printf("%p\n", &arr);
//	printf("%p\n", &arr+1);//整个数组
//
//}

//int my_strlen(char* str)
//{
//	char* start = str;
//	char* end = str;
//	while (*end != '\0')
//	{
//		end++;
//	}
//	return end - start;
//}
//
//int main()
//{
//	char arr[] = "bit";
//	int len = my_strlen(arr);
//	printf("%d\n", len);
//}

//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	char ch[5] = { 0 };
//	printf("%d", & arr[9] - &arr[0]);//指针减指针得到指针间的元素个数
//	printf("%d", &arr[9] - &ch[0]);//err
//}

////加，减整数
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	int* p = arr;
//	for (i = 0;i < sz;i++)
//	{
//		printf("%d ", *p);
//		p = p + 1;
//	}
//}

/*****************************野指针**********************************/

///*进入函数，创建变量*/int* test()
//{
//	int a = 10;
//
//	return &a;
//}/*函数结束，变量销毁，空间释放*/
//
//int main()
//{
//	int* p = test();
//	*p = 20;//指针指向的空间被释放
//}

//int main()
//{
//	int arr[10] = { 0 };
//	int* p = arr;
//	int i = 0;
//	for (i = 0;i < 12;i++)
//	{
//		*(p++)=i;//指针越界
//	}
//	return 0;
//}

//int main()
//{
//	int a;//局部变量不初始化，默认是随机值
//	int* p = &a;//局部的指针变量，就被初始化随机值，NULL用来初始化指针
//	*p = 20;
//	return 0;
//}

/*****************************指针类型********************************/

//int main()
//{
//	//指针类型决定了指针的步长
//	int a = 0x11223344;
//	int* pa = &a;//步长4个字节
//	char* pc = &a;//步长1个字节
//	printf("%p\n", pa);
//	printf("%p\n", pa+1);
//
//	printf("%p\n", pc);
//	printf("%p\n", pc+1);
//}

//int main()
//{
//	int arr[10] = { 0 };
//	//int* p = arr;
//	char* p = arr;//对比不同
//	int i = 0;
//	for (i = 0;i < 10;i++)
//	{
//		*(p + i) = 1;
//	}
//}

//int main()
//{
//	int a = 0x11223344;
//	int* pa = &a;//能访问4个字节
//	char* pc = &a;//能访问1个字节
//	double* pd = &a;//能访问8个字节
//
//	printf("%p\n", pa);
//	printf("%p\n", pc);//相同
//
//	*pa = 0;
//	*pc = 0;//指针类型决定了指针进行解引用操作时，能访问的空间大小
//	return 0;
//}